<a href="https://colab.research.google.com/github/mervebdurna/machine-learning-training-projects/blob/main/Data%20Science%20Specialization-Michigan%20University/Python/Week_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

# Merging DataFrames

In [19]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role' : 'Directo of HR'},
                         {'Name': 'Sally', 'Role' : 'Course liasion'},
                         {'Name': 'James', 'Role' : 'Grader'}])
staff_df.set_index('Name',inplace=True)
staff_df.head()

                 Role
Name
Kelly   Directo of HR
Sally  Course liasion
James          Grader

In [20]:
student_df = pd.DataFrame([{'Name': 'James', 'School' : 'Business'},
                         {'Name': 'Mike', 'School' : 'Law'},
                         {'Name': 'Sally', 'School' : 'Engineering'}])
student_df.set_index('Name',inplace=True)
student_df.head()

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [21]:
pd.merge(staff_df, student_df, how='outer',right_index=True, left_index= True)

                 Role       School
Name
James          Grader     Business
Kelly   Directo of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [22]:
pd.merge(staff_df, student_df, how='inner',right_index=True, left_index= True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [23]:
pd.merge(staff_df, student_df, how='left',right_index=True, left_index= True)

                 Role       School
Name
Kelly   Directo of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [24]:
staff_df = staff_df.reset_index()
student_df=student_df.reset_index()

In [25]:
pd.merge(staff_df, student_df, how='right', on='Name')

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

In [ ]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role' : 'Directo of HR', 'Location' : 'State Street'},
                         {'Name': 'Sally', 'Role' : 'Course liasion', 'Location' : 'Washington Avenue'},
                         {'Name': 'James', 'Role' : 'Grader'}, 'Location' : 'Washington Avenue'])

student_df = pd.DataFrame([{'Name': 'James', 'School' : 'Business', 'Location' :'1024 Billiard Avenue' },
                         {'Name': 'Mike', 'School' : 'Law', 'Location' :'Fraternity House 22' },
                         {'Name': 'Sally', 'School' : 'Engineering', 'Location' :'512 Wilson Crescent' }])